source/_posts/lang/shen/tutorial-of-shen.org
#+title:  tutorial of shen

* note

*** bar-ket
    * () 代碼
    * [] list
      其中的 () 是會被計算的
    * {} 類型聲明
    * <> vector
      但是因爲要作大於號和小於號
      所以 reader 不用這種括號
      只能是 writer 用

*** >< hash-table

*** >< type

*** pattern-match
    * 在蟬語中
      在提供了基本的函數語義和語法擴展機制之後
      再在其內實現模式匹配

* function application
  * 函數作用 完全地一元化 即 curry
  * "作用" 是
    以 "()" 爲邊綴符號的
    多元函數
    邊界所包圍的值中
    有一個是特殊的 被視爲函數
    而其餘的 被視爲其參數
  * 在邊綴表達式 所界定的邊界內
    1. 參數個數不夠時
       會形成 curry
    2. 參數個數多出時
       也可能還有默認的處理方式
       尤其是二元函數
       尤其是具有結合性的二元函數
  * 只要注意
    在邊綴表達式 所界定的邊界內
    元素個數的不同會引起不同的處理方式就可以了
    正式邊綴表達式的使用 使得同一個函數能夠承載多種語義的
  * 注意這與蟬語的處理方式不同
    蟬語的函數作用是
    以 "()" 爲邊綴符號的
    [即 小圈]
    一元函數
    其參數之取用由各個函數本身決定
    小圈之外還有大圈可用以定界
    以幫助優化完全 curry 的語法
  #+begin_src shen
  \* all curry *\
  \* eager-eval *\

  (+ (* 7 8) 2)
  (* 7)
  #+end_src

* lambda abstraction
  * λ xyz : N  =
    (/. x y z N)
  #+begin_src shen
  (/. X X)
  ((/. X X) 9)
  ((/. X Y Y) 6 7)
  ((/. X Y (* X Y)) 6 7)
  #+end_src

* data type

*** boolean
    true and false are booleans
    The basic boolean operators are:
    * if
    * and
    * or
    * not
    * cases (like cond in lisp)
    #+begin_src shen
    (if (= 6 (+ 4 2))
        yes
        no)

    (and (number? 6)
         (string? "3"))

    (or (= 8 8)
        (= 8 9))

    \\ 9 is NOT a boolean
    \\ so the following get you error

    (or 9 (= 8 8))

    (cases
     (= 8 9) kkk
     (= 8 7) aaa
     true error!
     )
    #+end_src

*** symbol

***** intern
      * 即 string->symbol
        這是用一個 散列表 來實現的
      #+begin_src shen
      (intern "kkk")
      #+end_src

***** hash
      * 這裏所給出的是一般用途的散列函數
      #+begin_src shen
      \\ (hash a n)
      \\ where a is any expression and n is a natural number
      \\ will give the hash value of a within the interval 0 to n
      (hash abc 10)
      (hash abc 100)
      (hash abc 1000)
      (hash abc 10000)
      #+end_src

***** property list
      * 這種語義
        可用以統一 函數名 變元名 等各種 名
        的實現方式
        當然
        伴隨着這種統一而來的是靈活的使用方式
      * 可以看出 鏈表處理 對這個語義有很大的影響
        因爲
        如果想要以靈活的方式使用
        字符串 到 一個大的向量的索引 的 散列函數
        那麼 散列表 對衝突的處理就勢必使用鏈表
        想要把這裏的設計決策做好 所需要考慮的因素是非常多的
      * 術語上
        散列函數 進行計算
        散列表 處理衝突
      #+begin_src shen
      (put table 1 a)
      (put table 2 [kkk])
      (put table 3 c)

      (get table 1)
      (get table 2)
      (get table 3)
      #+end_src

*** string
    #+begin_src shen
    (str 123)
    (str "123")
    (str abc)

    (cn "1" "2")
    (@s "1" "2")
    (@s "111" "222" "333")

    (pos "12345" 3)

    (tlstr "12345")
    #+end_src

*** list
    #+begin_src shen
    (= [1 (+ 1 1) 3]
       [1 2 3])

    (head [1])
    (tail [1])
    (cons 1 [])
    (cons 1 2)
    [1 2 | [3]]
    #+end_src

*** vector
    #+begin_src shen
    \\ vector creates a vector
    \\ with n element numbered from 1 to n
    (vector 0) \\ = <>
    (vector 3)

    (set *myvector* (@v 1 <>))
    (vector? (value *myvector*))

    \\ and the index 0 holds the size of the vector
    (limit (value *myvector*))
    \\ should equal to
    (<-vector (value *myvector*) 0)
    \\ but "cannot access 0th element of a vector"

    (<-vector (value *myvector*) 1)

    (@v 0 (value *myvector*)) \\ NOT side effect but copy elements
    (limit (value *myvector*))
    \\ so
    \\ use @v to create vector is waste of GC

    (set *myvector*
          (@v 0 (value *myvector*))) \\ side effect
    (limit (value *myvector*))

    (<-vector (value *myvector*) 2)
    (vector-> (value *myvector*) 2 a) \\ side effect

    (value *myvector*)
    #+end_src

*** pair
    #+begin_src shen
    (@p (@p 1 2) 3)

    (@p 1 2 3 4)
    \\ equals to
    (@p 1 (@p 2 (@p 3 4)))

    (fst (@p 1 2))
    (snd (@p 1 2))

    (tuple? (@p 1 (@p 2 3)))
    (tuple? (@p (@p 2 3) 1))

    \\ pair 是一個獨立的數據型
    \\ list is not implemented by pair
    (tuple? [1 | 2])

    \\ pair is implemented by vector [1 level lower vector]
    \\ normal vector is as (<size> <value> <value> ...)
    \\ while pair is as (tuple <value> <value> ...)
    \\ thus the predicate tuple? get implemented well
    #+end_src

*** @s @p @v
    * 這三個都不是副作用
      都以相同的方式展開
      (@x _ _ _ _)
      =>
      (@x _ (@x _ (@x _ _)

* side effect

*** assignment
    * 由於簡化了 symbol 的使用方式
      所以
      當要把一個 symbol 作爲 var 時
      就需要明顯地使用 value
    * 函數的命名空間和變量的命名空間是分離的
    #+begin_src shen
    \\ global
    (set dozen 6)
    (value dozen)
    (bound? dozen)

    \\ local
    \\   in the body
    \\   one can not reset X to other value
    \\   but one can use another let to block X
    (let X 6
         Y 5
      (* X Y))
    #+end_src

*** io

***** open & close
      #+begin_src shen
      \\ open is relative to *home-directory*
      \\ one can use cd to change *home-directory*

      \\ stream is buffer with

      \\ The basic functions for streams are
      \\ open
      \\ close
      \\ stinput
      \\ stoutput

      \\ on open
      \\   in  for read
      \\   out for write
      \\ so
      \\ the file is viewed as be in the outside

      (set *mystream* (open "learning-shen.org" in))
      (close (value *mystream*))
      #+end_src

***** read-byte
      #+begin_src shen
      \\ read-byte
      \\ write-byte
      (set *mystream* (open "learning-shen.org" in))
      (read-byte (value *mystream*))
      (close (value *mystream*))
      #+end_src

***** write-byte
      #+begin_src shen
      (write-byte 1 (stoutput))
      (write-byte 2 (stoutput))
      (write-byte 3 (stoutput))

      \\ write will create and overwrite file when needed

      (set *mystream* (open "kkk.org" out))

      (write-byte 1 (value *mystream*))
      (write-byte 2 (value *mystream*))
      (write-byte 3 (value *mystream*))

      (close (value *mystream*))
      #+end_src

***** nl [newline]
      #+begin_src shen
      (nl)
      \\ print a new line and return 0
      (nl 10)
      \\ print 10 new line and return 0
      #+end_src

***** pr [write-string]
      #+begin_src shen
      (pr "abc")
      (pr "abc" (stoutput))
      \\ * denotes print
      \\ * receiving a string and printing it to the terminal
      \\   and returning it as a value
      \\ * second optional argument
      \\   is where you wish to print the string to
      \\   the default place is (stoutput)
      #+end_src

***** print [write-sexp,after-eval]
      #+begin_src shen
      (print (@v 1 2 <>))

      (print [(@v 1 2 <>)
              (@v 3 4 <>)
              5])
      #+end_src

***** output [write-string,with-slot]
      #+begin_src shen
      \\ * ~% print a new line
      (output "a string~%")
      (output "a string~%" (stoutput))

      \\ return what output return
      \\ but do not print
      \\ output and print are implemented by make-string and pr
      (make-string "a string~%")

      \\ * ~A A denotes a thing
      (output "~A says, hello world~%" "Fred")
      (output "~A say, hello world~%" [Bill and Ben (+ 1 1)])

      \\ * ~S with string's double quote
      (output "~S says, hello world~%" "Fred")
      (output "~S say, hello world~%" [Bill and Ben (+ 1 1)])

      \\ * ~R with round bra-ket
      (output "~R say, hello world~%" [Bill and Ben (+ 1 1)])
      #+end_src

