source/_posts/lang/shen/tutorial-of-shen.org
***** about read
      * a shen token is a sexp
      * lineread
        reads in a line of Shen tokens terminated by a new line.
      * read
        reads the first available Shen token
      * input
        reads the first available Shen token and evaluates it
        returning a normal form
      * input+
        receives a type T
        and a stream S
        and reads the first token off S
        evaluates it
        and returns the normal form
        if that token is of type T
        If the token is not of type T
        then an error is returned
      * all these functions return an error empty stream
        if the stream is empty

***** lineread [read-line,as-list]
      #+begin_src shen
      \\ read one line of input to a list
      (lineread)

      \\ type:    1 2 3
      \\ return: [1 2 3]

      \\ type:    1 2 (+ 1 2)
      \\ return: [1 2 [+ 1 2]]

      \\ type:    1 2 [+ 1 2]
      \\ return: [1 2 [cons + [cons 1 [cons 2 []]]]]
      #+end_src

***** read [read-sexp]
      #+begin_src shen
      (read)

      \\ type:   (+ 1 2)
      \\ return: [+ 1 2]

      \\ type:   [+ 1 2]
      \\ return: [cons + [cons 1 [cons 2 []]]]
      #+end_src

***** input [read-sexp,and-eval]
      #+begin_src shen
      (input)

      \\ type:   (+ 1 2)
      \\ return: 3

      \\ type:   [+ 1 2]
      \\ return: [+ 1 2]
      #+end_src

***** path
      #+begin_src shen
      \\ (DEFUN make-pathname (Name) (MAKE-PATHNAME :NAME Name))
      (LOAD "test.lsp")
      (make-pathname "abc")
      #+end_src

***** file
      #+begin_src shen
      \\ as string
      (write-to-file "factorial.shen"
      "
      (define factorial
        0 -> 1
        X -> (* X (factorial (- X 1))))
      "
      )

      (read-file "factorial.shen") \\ as sexp
      (read-file-as-bytelist "factorial.shen")

      (load "factorial.shen") \\ eval the file
      (factorial 3)
      #+end_src

***** hush
      *hush* is set by default to false
      If set to true
      then all messages printed from output and print are disabled
      through messages using pr will still be printed to the target stream
      Effectively this disables system reports from Shen
      and all printing is then driven by the user
      This very useful feature was suggested by Ramil Farkshatov
      as an aid to diagnostics
      #+begin_src shen
      (set *hush* true)

      (pr "abc")
      #+end_src

* name

*** define
    * 所有的函數都必須用 pattern-match 來定義
      模式匹配在於綁定約束變元
      而
      簡單的函數參數作爲約束變元的的綁定
      只不過是一般的模式匹配所能形成的約束變元的綁定的特殊情況
    * 模式匹配是處理結構化數據的良好方式
      因爲此時結構化數據的結構
      能得以最直觀的方式被展現給讀者
    * 模式匹配只有和數據構造子一起使用才好
      因爲豐富的數據的構造子是產生結構化數據的主要方式

*** zero arg
    #+begin_src shen
    (define kkk
      -> 1)
    (kkk)
    #+end_src

*** two name-space
    * symbol is a symbol
      (value symbol) is the value bound to symbol
      (function symbol) is the function bound to symbol
    #+begin_src shen
    (define kkk
      X -> 1)
    (kkk 90)
    ((function kkk) 90)

    (set kkk (lambda X X))
    ((value kkk) 90)
    #+end_src

*** simple ^-^
    #+begin_src shen
    (define factorial
      0 -> 1
      X -> (* X (factorial (- X 1))))
    (factorial 1)
    (factorial 3)
    (factorial 6)

    \\ 在 @s 這個構造子所形成的模式中
    \\ 從前向後匹配子字符串
    \\ 每個約束變元匹配一個長度爲1的字符串
    \\ 尾部約束變元特殊處理
    (define kkk
      (@s A B C) -> C)
    (kkk "123456")

    (define kkk
      (@s A "456") -> A)
    (kkk "1456")
    (kkk "123456")

    (define kkk
      (@s "___" A "___" String-tail) -> A)
    (kkk "___k___123")

    (define kkk->aaa
      "" -> ""
      (@s "kkk" Tail) -> (@s "aaa" (kkk->aaa Tail))
      (@s S Tail) -> (@s S (kkk->aaa Tail)))
    (kkk->aaa "kkk xxx kkk xxx")

    (define total
      [] -> 0
      [X | Y] -> (+ X (total Y)))
    (total [1 2 3])
    #+end_src

*** where and <-
    #+begin_src shen
    \\ 用 where 來做條件匹配
    (define mmm
      X Y -> X where (> X Y)
      _ Y -> Y)
    (mmm 1 2)

    \\ backtracking is invoked by using <- in place of ->
    \\ 匹配到一個值了 然後拿來用了
    \\ 然後發現不對勁的時候 只要返回 (fail)
    \\ 就退出這個此比配 而進入下一個匹配
    \\ 這比 where 更靈活
    (define mmm
      X Y <- (if (> X Y)
                 X
                 (fail))
      _ Y -> Y)
    (mmm 1 2)
    #+end_src

* eval
  * 這裏是 [] 的劣勢
    因爲爲了寫一個以鏈表方式表示的函數
    需要改變很多括號
    一個好
  #+begin_src shen
  (eval [+ 1 2])

  (eval
   [define factorial
     0 -> 1
     X -> [* X [factorial [- X 1]]]])
  (factorial 6)

  (eval
   [define factorial
     0 -> 1
     (hd (cons X [Y])) -> [* X [factorial [- X 1]]]])

  (eval
   [define rev
     [] -> []
     [cons X Y] -> [append [rev Y] [cons X []]]])
  (rev [1 2 3])
  #+end_src

* native call to sbcl
  #+begin_src shen
  \\ a native common lisp function is uppercase

  ((protect REVERSE) [1 2 3])

  (define my-reverse
    X -> ((protect REVERSE) X))
  (my-reverse [1 2 3])

  \\ In order to load a CL file,
  \\ the readtable must be reset
  \\ and re-reset after loading
  \\ to conform to the differences between CL and Shen.
  \\ The function load-lisp in the following program will do that;
  \\ (load-lisp "foo.lisp")
  \\ will load the CL file foo.lsp.

  (define load-lisp
    File -> (trap-error
             (let LispReadTable (readtable upcase)
                  Load ((protect LOAD) File)
                  ShenReadTable (readtable preserve)
                  loaded)
             (/. Error
                 (do (readtable preserve)
                     (error (error-to-string Error))))))

  (define readtable
    Case -> (let String
              (make-string
               "(SETF (READTABLE-CASE *READTABLE*) ~A)"
               (cases (= Case upcase) ":UPCASE"
                      (= Case downcase) ":DOWNCASE"
                      (= Case preserve) ":PRESERVE"
                      (= Case invert) ":INVERT"
                      true (error "case ~A not recognised~%" Case)))
              ((protect EVAL) ((protect READ-FROM-STRING) String))))


  \\ Note that the CL functions loaded from a CL file in this way
  \\ will revert to uppercase after load-lisp is finished.
  \\ Hence a function 'foo' in the CL file
  \\ will be invoked by 'FOO' from within Shen.
  #+end_src

* lazy-eval
  * 在 shen 中沒有零元的 lambda-abstraction
    所以不能直接用 lambda-abstraction 來形成惰性求值
  #+begin_src shen
  (freeze (+ 8 9))
  (thaw (freeze (+ 8 9)))
  #+end_src

* exceptions
  #+begin_src shen
  (simple-error "ererer")

  (set kkk 999)

  \\ 不會有新的賦值
  \\ 當 simple-error 作用的時候 就會做一個全局的跳出
  (set kkk (simple-error "ererer"))


  \\ "error" has the same formating features as "output"
  (error "this is an error message, followed by a new line~%")


  \*

  (trap-error)
    exp:
    call-with-error:
  1. if meet error(exception) in exp
     fun will be called with the error as an argument
  2. if not meet error in exp
     the whole will be as exp

  ,*\

  (trap-error
   (error "this is an error message, followed by a new line~%")
   (/. E "I trapped the error."))

  (trap-error
   (simple-error "ererer")
   (/. E (+ E E)))

  (trap-error
   (error "this is an error message, followed by a new line~%")
   (/. E (error-to-string E)))

  (trap-error
    1
    (/. E (error-to-string E)))
  #+end_src

* type

