out/lang/shen/tutorial-of-shen.org.html
      * a shen token is a sexp
      * lineread
        reads in a line of Shen tokens terminated by a new line.
      * read
        reads the first available Shen token
      * input
        reads the first available Shen token and evaluates it
        returning a normal form
      * input+
        receives a type T
        and a stream S
        and reads the first token off S
        evaluates it
        and returns the normal form
        if that token is of type T
        If the token is not of type T
        then an error is returned
      * all these functions return an error empty stream
        if the stream is empty

***** lineread [read-line,as-list]
      #+begin_src shen
      \\ read one line of input to a list
      (lineread)

      \\ type:    1 2 3
      \\ return: [1 2 3]

      \\ type:    1 2 (+ 1 2)
      \\ return: [1 2 [+ 1 2]]

      \\ type:    1 2 [+ 1 2]
      \\ return: [1 2 [cons + [cons 1 [cons 2 []]]]]
      #+end_src

***** read [read-sexp]
      #+begin_src shen
      (read)

      \\ type:   (+ 1 2)
      \\ return: [+ 1 2]

      \\ type:   [+ 1 2]
      \\ return: [cons + [cons 1 [cons 2 []]]]
      #+end_src

***** input [read-sexp,and-eval]
      #+begin_src shen
      (input)

      \\ type:   (+ 1 2)
      \\ return: 3

      \\ type:   [+ 1 2]
      \\ return: [+ 1 2]
      #+end_src

***** path
      #+begin_src shen
      \\ (DEFUN make-pathname (Name) (MAKE-PATHNAME :NAME Name))
      (LOAD &quot;test.lsp&quot;)
      (make-pathname &quot;abc&quot;)
      #+end_src

***** file
      #+begin_src shen
      \\ as string
      (write-to-file &quot;factorial.shen&quot;
      &quot;
      (define factorial
        0 -&gt; 1
        X -&gt; (* X (factorial (- X 1))))
      &quot;
      )

      (read-file &quot;factorial.shen&quot;) \\ as sexp
      (read-file-as-bytelist &quot;factorial.shen&quot;)

      (load &quot;factorial.shen&quot;) \\ eval the file
      (factorial 3)
      #+end_src

***** hush
      *hush* is set by default to false
      If set to true
      then all messages printed from output and print are disabled
      through messages using pr will still be printed to the target stream
      Effectively this disables system reports from Shen
      and all printing is then driven by the user
      This very useful feature was suggested by Ramil Farkshatov
      as an aid to diagnostics
      #+begin_src shen
      (set *hush* true)

      (pr &quot;abc&quot;)
      #+end_src

* name

*** define
    * 所有的函數都必須用 pattern-match 來定義
      模式匹配在於綁定約束變元
      而
      簡單的函數參數作爲約束變元的的綁定
      只不過是一般的模式匹配所能形成的約束變元的綁定的特殊情況
    * 模式匹配是處理結構化數據的良好方式
      因爲此時結構化數據的結構
      能得以最直觀的方式被展現給讀者
    * 模式匹配只有和數據構造子一起使用才好
      因爲豐富的數據的構造子是產生結構化數據的主要方式

*** zero arg
    #+begin_src shen
    (define kkk
      -&gt; 1)
    (kkk)
    #+end_src

*** two name-space
    * symbol is a symbol
      (value symbol) is the value bound to symbol
      (function symbol) is the function bound to symbol
    #+begin_src shen
    (define kkk
      X -&gt; 1)
    (kkk 90)
    ((function kkk) 90)

    (set kkk (lambda X X))
    ((value kkk) 90)
    #+end_src

*** simple ^-^
    #+begin_src shen
    (define factorial
      0 -&gt; 1
      X -&gt; (* X (factorial (- X 1))))
    (factorial 1)
    (factorial 3)
    (factorial 6)

    \\ 在 @s 這個構造子所形成的模式中
    \\ 從前向後匹配子字符串
    \\ 每個約束變元匹配一個長度爲1的字符串
    \\ 尾部約束變元特殊處理
    (define kkk
      (@s A B C) -&gt; C)
    (kkk &quot;123456&quot;)

    (define kkk
      (@s A &quot;456&quot;) -&gt; A)
    (kkk &quot;1456&quot;)
    (kkk &quot;123456&quot;)

    (define kkk
      (@s &quot;___&quot; A &quot;___&quot; String-tail) -&gt; A)
    (kkk &quot;___k___123&quot;)

    (define kkk-&gt;aaa
      &quot;&quot; -&gt; &quot;&quot;
      (@s &quot;kkk&quot; Tail) -&gt; (@s &quot;aaa&quot; (kkk-&gt;aaa Tail))
      (@s S Tail) -&gt; (@s S (kkk-&gt;aaa Tail)))
    (kkk-&gt;aaa &quot;kkk xxx kkk xxx&quot;)

    (define total
      [] -&gt; 0
      [X | Y] -&gt; (+ X (total Y)))
    (total [1 2 3])
    #+end_src

*** where and &lt;-
    #+begin_src shen
    \\ 用 where 來做條件匹配
    (define mmm
      X Y -&gt; X where (&gt; X Y)
      _ Y -&gt; Y)
    (mmm 1 2)

    \\ backtracking is invoked by using &lt;- in place of -&gt;
    \\ 匹配到一個值了 然後拿來用了
    \\ 然後發現不對勁的時候 只要返回 (fail)
    \\ 就退出這個此比配 而進入下一個匹配
    \\ 這比 where 更靈活
    (define mmm
      X Y &lt;- (if (&gt; X Y)
                 X
                 (fail))
      _ Y -&gt; Y)
    (mmm 1 2)
    #+end_src

* eval
  * 這裏是 [] 的劣勢
    因爲爲了寫一個以鏈表方式表示的函數
    需要改變很多括號
    一個好
  #+begin_src shen
  (eval [+ 1 2])

  (eval
   [define factorial
     0 -&gt; 1
     X -&gt; [* X [factorial [- X 1]]]])
  (factorial 6)

  (eval
   [define factorial
     0 -&gt; 1
     (hd (cons X [Y])) -&gt; [* X [factorial [- X 1]]]])

  (eval
   [define rev
     [] -&gt; []
     [cons X Y] -&gt; [append [rev Y] [cons X []]]])
  (rev [1 2 3])
  #+end_src

* native call to sbcl
  #+begin_src shen
  \\ a native common lisp function is uppercase

  ((protect REVERSE) [1 2 3])

  (define my-reverse
    X -&gt; ((protect REVERSE) X))
  (my-reverse [1 2 3])

  \\ In order to load a CL file,
  \\ the readtable must be reset
  \\ and re-reset after loading
  \\ to conform to the differences between CL and Shen.
  \\ The function load-lisp in the following program will do that;
  \\ (load-lisp &quot;foo.lisp&quot;)
  \\ will load the CL file foo.lsp.

  (define load-lisp
    File -&gt; (trap-error
             (let LispReadTable (readtable upcase)
                  Load ((protect LOAD) File)
                  ShenReadTable (readtable preserve)
                  loaded)
             (/. Error
                 (do (readtable preserve)
                     (error (error-to-string Error))))))

  (define readtable
    Case -&gt; (let String
              (make-string
               &quot;(SETF (READTABLE-CASE *READTABLE*) ~A)&quot;
               (cases (= Case upcase) &quot;:UPCASE&quot;
                      (= Case downcase) &quot;:DOWNCASE&quot;
                      (= Case preserve) &quot;:PRESERVE&quot;
                      (= Case invert) &quot;:INVERT&quot;
                      true (error &quot;case ~A not recognised~%&quot; Case)))
              ((protect EVAL) ((protect READ-FROM-STRING) String))))


  \\ Note that the CL functions loaded from a CL file in this way
  \\ will revert to uppercase after load-lisp is finished.
  \\ Hence a function &apos;foo&apos; in the CL file
  \\ will be invoked by &apos;FOO&apos; from within Shen.
  #+end_src

* lazy-eval
  * 在 shen 中沒有零元的 lambda-abstraction
    所以不能直接用 lambda-abstraction 來形成惰性求值
  #+begin_src shen
  (freeze (+ 8 9))
  (thaw (freeze (+ 8 9)))
  #+end_src

* exceptions
  #+begin_src shen
  (simple-error &quot;ererer&quot;)

  (set kkk 999)

  \\ 不會有新的賦值
  \\ 當 simple-error 作用的時候 就會做一個全局的跳出
  (set kkk (simple-error &quot;ererer&quot;))


  \\ &quot;error&quot; has the same formating features as &quot;output&quot;
  (error &quot;this is an error message, followed by a new line~%&quot;)


  \*

  (trap-error)
    exp:
    call-with-error:
  1. if meet error(exception) in exp
     fun will be called with the error as an argument
  2. if not meet error in exp
     the whole will be as exp

  ,*\

  (trap-error
   (error &quot;this is an error message, followed by a new line~%&quot;)
   (/. E &quot;I trapped the error.&quot;))

  (trap-error
   (simple-error &quot;ererer&quot;)
   (/. E (+ E E)))

  (trap-error
   (error &quot;this is an error message, followed by a new line~%&quot;)
   (/. E (error-to-string E)))

  (trap-error
    1
    (/. E (error-to-string E)))
  #+end_src

* type
