source/_posts/lang/shen/tutorial-of-shen.org
*** type check value
    #+begin_src shen
    \\ type check
    (tc +)

    \\ no type check
    (tc -)


    kkk
    \\ kkk : symbol

    "kkk"
    \\ "kkk" : string

    (@s "10" " green" " bottles")
    \\ "10 green bottles" : string

    true
    \\ true : boolean
    (= 4 5)
    \\ false : boolean

    666
    \\ 666 : number
    (* 2.3 2)
    \\ 4.6 : number

    [1 a]
    \\ type error

    [1 2 3]
    \\ [1 2 3] : (list number)

    (@p 1 2 a)
    \\ (@p 1 (@p 2 a)) : (number * (number * symbol))

    (@v 1 2 3 <>)
    \\ <1 2 3> : (vector number)

    (freeze (* 7 8))
    \\ #<FUNCTION (LAMBDA ()) {100442ED6B}> : (lazy number)

    (/. X X)
    \\ #<FUNCTION (LAMBDA (X)) {100461DCCB}> : (A --> A)

    (freeze (/. X X))
    \\ #<FUNCTION (LAMBDA ()) {10046B71BB}> : (lazy (A --> A))
    #+end_src

*** define typed function
    #+begin_src shen
    \\ typed version of the following function is hard
    (tc -)
    (define tuple->list
      (@p X Y) -> [X | (tuple->list Y)]
      X -> [X])
    (tuple->list (@p 1 2 3))


    (tc +)

    (define factorial
      {number --> number}
      0 -> 1
      X -> (* X (factorial (- X 1))))
    (factorial 1)
    (factorial 3)
    (factorial 6)

    (define kkk->aaa
      {string --> string}
      "" -> ""
      (@s "kkk" Tail) -> (@s "aaa" (kkk->aaa Tail))
      (@s S Tail) -> (@s S (kkk->aaa Tail)))
    (kkk->aaa "kkk xxx kkk xxx")


    (define unit-vector?
      {(vector A) --> boolean}
      (@v _ <>) -> true
      _ -> false)
    (unit-vector? (@v 1 <>))
    (unit-vector? (@v 1 2 <>))

    (define unit-string?
      {string --> boolean}
      (@s X "") -> true
      _ -> false)
    (unit-string? "a")
    (unit-string? "abc")


    \\ NO side effect
    (define vector-double
      {(vector number) --> (vector number)}
      <> -> <>
      (@v X V) -> (@v (+ X X) (vector-double V)))
    (vector-double (@v 1 2 3 <>))

    (define remove-duplicates
      {(list A) --> (list A)}
      [] -> []
      [X | Y] -> (remove-duplicates Y) where (element? X Y)
      [X | Y] -> [X | (remove-duplicates Y)])
    (remove-duplicates [2 3 3 3 3  2 3 3 3 3 3])

    (define total
      {(list number) --> number}
      [] -> 0
      [X | Y] -> (+ X (total Y)))
    (total [1 2 3])

    (define member
      {A --> (list A) --> boolean}
      _ [] -> false
      X [X | _] -> true
      X [_ | Y] -> (member X Y))
    (member 1 [1 2 3])
    (member 4 [1 2 3])
    (member a [1 2 3])


    \\ 下面是二元函數的迭代
    (define foldl
      {(A --> A --> A) --> A --> (list A) --> A}
      F Z [] -> Z
      F Z [X | Xs] -> (foldl F (F Z X) Xs))
    (foldl (function +) 0 [1 2 3])
    #+end_src

*** nick name of type
    #+begin_src shen
    (tc +)

    (synonyms coordinate (number * number))

    \\ type:
    (@p 1 2) : coordinate
    \\ echo:
    (@p 1 2) : (number * number)
    #+end_src

*** sequent calculus
    * 模仿邏輯學中的古怪語法來定義新的數據類型
      是設計上的敗筆
    #+begin_src shen
    (tc +)

    (datatype color

      ____________
      yellow : color;

      __________
      red : color;

      ___________
      green : color;)

    (datatype color

      if (element? X [red yellow green blue])
      __________________________________
      X : color;)

    (define kkk
      {color --> string}
      X -> (str X))

    (kkk red)
    (kkk 1)



    (datatype rank

      if (element? X [ace 2 3 4 5 6 7 8 9 10 jack queen king])
      __________________________________
      X : rank;)

    (datatype suit

      if (element? Suit [spades hearts diamonds clubs])
      __________________________________
      Suit : suit;)

    (datatype card

      Rank : rank;
      Suit : suit;
      __________________________________
      [Rank Suit] : card;

      Rank : rank, Suit : suit >> P;
      __________________________________
      [Rank Suit] : card >> P;
      )

    (datatype card

      Rank : rank;
      Suit : suit;
      ==================
      [Rank Suit] : card;)

    [5 spades]
    [king hearts]
    [king hearts] : card

    (define get-suit
      {card --> suit}
      [Rank Suit] -> Suit)
    (get-suit [5 spades])
    (get-suit [king hearts])
    #+end_src

* macro
  #+begin_src shen
  (defmacro macro-add1
    [add1 N] -> [+ N 1]
    [sub1 N] -> [- N 1])

  (value *macros*)
  (function macroexpand)

  (add1 100)
  (sub1 100)

  (macroexpand [sub1 100])

  (defmacro exec-macro
    [exec Expr]
    -> [trap-error [time Expr] [/. (protect E) failed]])

  (exec
   (value *macros*))

  (macroexpand
   [exec
    [value *macros*]])
  #+end_src

* compiler-compiler

*** 用 defcc 來定義作用於鏈表的謂詞
    #+begin_src shen
    \\ 句子 == 名詞詞組 動詞詞組
    (defcc <sent>
      <np> <vp>;)
    \\ 名詞詞組 == 冠詞 名詞 | 專有名詞
    (defcc <np>
      <det> <n>;
      <name>;)
    \\ 冠詞 == 定冠詞 | 不定冠詞
    (defcc <det>
      the;
      a;)
    \\ 一些名詞
    (defcc <n>
      cat;
      dog;)
    \\ 一些專有名詞
    (defcc <name>
      bill;
      ben;)
    \\ 動詞詞組 == 謂語動詞 名詞詞組
    (defcc <vp>
      <vtrans> <np>;)
    \\ 一些謂語動詞
    (defcc <vtrans>
      likes;
      chases;)

    (compile (function <det>)
             [the])
    (compile (function <det>)
             [a the])
    (compile (function <vp>)
             [chases the cat])
    (compile (function <sent>)
             [the cat likes the dog])
    (compile (function <sent>)
             [the cat likes the canary])


    (defcc <bcs>
      [<bs>] [<cs>];)

    (defcc <bs>
      b <bs>;
      b;)

    (defcc <cs>
      c <cs>;
      c;)

    (compile (function <bcs>)
             [[b b b] [c c]])
    (compile (function <bcs>)
             [[b b b] [c c]
              kkk])
    (compile (function <bcs>)
             [kkk
              [b b b] [c c]])
    #+end_src

*** semantic actions in yacc
    #+begin_src shen
    (defcc <as>
      a <as>;
      a;)

    (defcc <as>
      a <as> := [b | <as>];
      a := [b];)

    (compile (function <as>)
             [a a a a a])


    (define question
      NP VP -> (append
                [(protect Is) it true that]
                NP VP
                [?]))

    (question (compile (function <sent>)
                       [the cat likes the dog])
              [kkk])
    #+end_src

*** reserved non-terminals, pattern matching
    * <e> always succeeds consuming
      none of the input and under semantic completion
      returns the empty list
    * <!> always succeeds and consumes
      all of the input and under semantic completion
      returns that remaining input
    * variables and wildcards are allowed to pattern match
      under shen-yacc as in shen
      and lists can be embedded in the input.
      the | notation is not used in the parsing
      (to the left of :=)
      but can occur to the right

* prolog
  #+begin_src shen
  (defprolog member
    X [X | _] <--;
    X [_ | Y] <-- (member X Y);)

  (defprolog rev
    [] [] <--;
    [X | Y] Z <-- (rev Y W) (conc W [X] Z);)

  (defprolog conc
    [] X X <--;
    [X | Y] Z [X | W] <-- (conc Y Z W);)

  (prolog? (member 1 [1 2]))
  (prolog? (member 0 [1 2]))
  (prolog? (member X [1 2]))
  (prolog? (member X [1 2]) (return X))
  (prolog? (rev [1 2] X) (return X))
  #+end_src

* package
  #+begin_src shen
  (package aaa. [bbb] ccc)
  #+end_src
