out/lang/shen/tutorial-of-shen.org.html

*** type check value
    #+begin_src shen
    \\ type check
    (tc +)

    \\ no type check
    (tc -)


    kkk
    \\ kkk : symbol

    &quot;kkk&quot;
    \\ &quot;kkk&quot; : string

    (@s &quot;10&quot; &quot; green&quot; &quot; bottles&quot;)
    \\ &quot;10 green bottles&quot; : string

    true
    \\ true : boolean
    (= 4 5)
    \\ false : boolean

    666
    \\ 666 : number
    (* 2.3 2)
    \\ 4.6 : number

    [1 a]
    \\ type error

    [1 2 3]
    \\ [1 2 3] : (list number)

    (@p 1 2 a)
    \\ (@p 1 (@p 2 a)) : (number * (number * symbol))

    (@v 1 2 3 &lt;&gt;)
    \\ &lt;1 2 3&gt; : (vector number)

    (freeze (* 7 8))
    \\ #&lt;FUNCTION (LAMBDA ()) {100442ED6B}&gt; : (lazy number)

    (/. X X)
    \\ #&lt;FUNCTION (LAMBDA (X)) {100461DCCB}&gt; : (A --&gt; A)

    (freeze (/. X X))
    \\ #&lt;FUNCTION (LAMBDA ()) {10046B71BB}&gt; : (lazy (A --&gt; A))
    #+end_src

*** define typed function
    #+begin_src shen
    \\ typed version of the following function is hard
    (tc -)
    (define tuple-&gt;list
      (@p X Y) -&gt; [X | (tuple-&gt;list Y)]
      X -&gt; [X])
    (tuple-&gt;list (@p 1 2 3))


    (tc +)

    (define factorial
      {number --&gt; number}
      0 -&gt; 1
      X -&gt; (* X (factorial (- X 1))))
    (factorial 1)
    (factorial 3)
    (factorial 6)

    (define kkk-&gt;aaa
      {string --&gt; string}
      &quot;&quot; -&gt; &quot;&quot;
      (@s &quot;kkk&quot; Tail) -&gt; (@s &quot;aaa&quot; (kkk-&gt;aaa Tail))
      (@s S Tail) -&gt; (@s S (kkk-&gt;aaa Tail)))
    (kkk-&gt;aaa &quot;kkk xxx kkk xxx&quot;)


    (define unit-vector?
      {(vector A) --&gt; boolean}
      (@v _ &lt;&gt;) -&gt; true
      _ -&gt; false)
    (unit-vector? (@v 1 &lt;&gt;))
    (unit-vector? (@v 1 2 &lt;&gt;))

    (define unit-string?
      {string --&gt; boolean}
      (@s X &quot;&quot;) -&gt; true
      _ -&gt; false)
    (unit-string? &quot;a&quot;)
    (unit-string? &quot;abc&quot;)


    \\ NO side effect
    (define vector-double
      {(vector number) --&gt; (vector number)}
      &lt;&gt; -&gt; &lt;&gt;
      (@v X V) -&gt; (@v (+ X X) (vector-double V)))
    (vector-double (@v 1 2 3 &lt;&gt;))

    (define remove-duplicates
      {(list A) --&gt; (list A)}
      [] -&gt; []
      [X | Y] -&gt; (remove-duplicates Y) where (element? X Y)
      [X | Y] -&gt; [X | (remove-duplicates Y)])
    (remove-duplicates [2 3 3 3 3  2 3 3 3 3 3])

    (define total
      {(list number) --&gt; number}
      [] -&gt; 0
      [X | Y] -&gt; (+ X (total Y)))
    (total [1 2 3])

    (define member
      {A --&gt; (list A) --&gt; boolean}
      _ [] -&gt; false
      X [X | _] -&gt; true
      X [_ | Y] -&gt; (member X Y))
    (member 1 [1 2 3])
    (member 4 [1 2 3])
    (member a [1 2 3])


    \\ 下面是二元函數的迭代
    (define foldl
      {(A --&gt; A --&gt; A) --&gt; A --&gt; (list A) --&gt; A}
      F Z [] -&gt; Z
      F Z [X | Xs] -&gt; (foldl F (F Z X) Xs))
    (foldl (function +) 0 [1 2 3])
    #+end_src

*** nick name of type
    #+begin_src shen
    (tc +)

    (synonyms coordinate (number * number))

    \\ type:
    (@p 1 2) : coordinate
    \\ echo:
    (@p 1 2) : (number * number)
    #+end_src

*** sequent calculus
    * 模仿邏輯學中的古怪語法來定義新的數據類型
      是設計上的敗筆
    #+begin_src shen
    (tc +)

    (datatype color

      ____________
      yellow : color;

      __________
      red : color;

      ___________
      green : color;)

    (datatype color

      if (element? X [red yellow green blue])
      __________________________________
      X : color;)

    (define kkk
      {color --&gt; string}
      X -&gt; (str X))

    (kkk red)
    (kkk 1)



    (datatype rank

      if (element? X [ace 2 3 4 5 6 7 8 9 10 jack queen king])
      __________________________________
      X : rank;)

    (datatype suit

      if (element? Suit [spades hearts diamonds clubs])
      __________________________________
      Suit : suit;)

    (datatype card

      Rank : rank;
      Suit : suit;
      __________________________________
      [Rank Suit] : card;

      Rank : rank, Suit : suit &gt;&gt; P;
      __________________________________
      [Rank Suit] : card &gt;&gt; P;
      )

    (datatype card

      Rank : rank;
      Suit : suit;
      ==================
      [Rank Suit] : card;)

    [5 spades]
    [king hearts]
    [king hearts] : card

    (define get-suit
      {card --&gt; suit}
      [Rank Suit] -&gt; Suit)
    (get-suit [5 spades])
    (get-suit [king hearts])
    #+end_src

* macro
  #+begin_src shen
  (defmacro macro-add1
    [add1 N] -&gt; [+ N 1]
    [sub1 N] -&gt; [- N 1])

  (value *macros*)
  (function macroexpand)

  (add1 100)
  (sub1 100)

  (macroexpand [sub1 100])

  (defmacro exec-macro
    [exec Expr]
    -&gt; [trap-error [time Expr] [/. (protect E) failed]])

  (exec
   (value *macros*))

  (macroexpand
   [exec
    [value *macros*]])
  #+end_src

* compiler-compiler

*** 用 defcc 來定義作用於鏈表的謂詞
    #+begin_src shen
    \\ 句子 == 名詞詞組 動詞詞組
    (defcc &lt;sent&gt;
      &lt;np&gt; &lt;vp&gt;;)
    \\ 名詞詞組 == 冠詞 名詞 | 專有名詞
    (defcc &lt;np&gt;
      &lt;det&gt; &lt;n&gt;;
      &lt;name&gt;;)
    \\ 冠詞 == 定冠詞 | 不定冠詞
    (defcc &lt;det&gt;
      the;
      a;)
    \\ 一些名詞
    (defcc &lt;n&gt;
      cat;
      dog;)
    \\ 一些專有名詞
    (defcc &lt;name&gt;
      bill;
      ben;)
    \\ 動詞詞組 == 謂語動詞 名詞詞組
    (defcc &lt;vp&gt;
      &lt;vtrans&gt; &lt;np&gt;;)
    \\ 一些謂語動詞
    (defcc &lt;vtrans&gt;
      likes;
      chases;)

    (compile (function &lt;det&gt;)
             [the])
    (compile (function &lt;det&gt;)
             [a the])
    (compile (function &lt;vp&gt;)
             [chases the cat])
    (compile (function &lt;sent&gt;)
             [the cat likes the dog])
    (compile (function &lt;sent&gt;)
             [the cat likes the canary])


    (defcc &lt;bcs&gt;
      [&lt;bs&gt;] [&lt;cs&gt;];)

    (defcc &lt;bs&gt;
      b &lt;bs&gt;;
      b;)

    (defcc &lt;cs&gt;
      c &lt;cs&gt;;
      c;)

    (compile (function &lt;bcs&gt;)
             [[b b b] [c c]])
    (compile (function &lt;bcs&gt;)
             [[b b b] [c c]
              kkk])
    (compile (function &lt;bcs&gt;)
             [kkk
              [b b b] [c c]])
    #+end_src

*** semantic actions in yacc
    #+begin_src shen
    (defcc &lt;as&gt;
      a &lt;as&gt;;
      a;)

    (defcc &lt;as&gt;
      a &lt;as&gt; := [b | &lt;as&gt;];
      a := [b];)

    (compile (function &lt;as&gt;)
             [a a a a a])


    (define question
      NP VP -&gt; (append
                [(protect Is) it true that]
                NP VP
                [?]))

    (question (compile (function &lt;sent&gt;)
                       [the cat likes the dog])
              [kkk])
    #+end_src

*** reserved non-terminals, pattern matching
    * &lt;e&gt; always succeeds consuming
      none of the input and under semantic completion
      returns the empty list
    * &lt;!&gt; always succeeds and consumes
      all of the input and under semantic completion
      returns that remaining input
    * variables and wildcards are allowed to pattern match
      under shen-yacc as in shen
      and lists can be embedded in the input.
      the | notation is not used in the parsing
      (to the left of :=)
      but can occur to the right

* prolog
  #+begin_src shen
  (defprolog member
    X [X | _] &lt;--;
    X [_ | Y] &lt;-- (member X Y);)

  (defprolog rev
    [] [] &lt;--;
    [X | Y] Z &lt;-- (rev Y W) (conc W [X] Z);)

  (defprolog conc
    [] X X &lt;--;
    [X | Y] Z [X | W] &lt;-- (conc Y Z W);)

  (prolog? (member 1 [1 2]))
  (prolog? (member 0 [1 2]))
  (prolog? (member X [1 2]))
  (prolog? (member X [1 2]) (return X))
  (prolog? (rev [1 2] X) (return X))
  #+end_src

* package
  #+begin_src shen
  (package aaa. [bbb] ccc)
  #+end_src
</pre>
</body>
</html>
